1) Реализовать класс, реализующий наш интерфейс для двумерной матрицы
2) Реализовать 2 конструктора. Первый генерит матрицу 5х5, второй - заданной величины
3) Создать наследника, который может содержать только матрицу, сумма элементов которой равна нулю
4) В классе двумерной матрицы реализовать превращение двумерного массива в List змейкой
К примеру дано:
1 2 3
4 5 6
7 8 9
Нужен лист: 1 2 3 6 9 8 7 4 5
5) Нарисовать крестик нулями.
Дано:
12345
12345
12345
12345
12345
Сделать:
12045
12045
00000
12045
12045

Дано
1234
1234
1234
1234
Надо:
1004
0000
0000
1004







На картинке фамилии и объекты класса обжект + коллекции.
Ваша задача по методам:
-Разобраться как работают, быть готовым рассказать\либо в кратце описать текстом (как хотите)
-Реализовать использование на практике
Ваша задача по коллекциям:
- Взять одну из реализаций коллекций (к примеру для листа я взял ArrayList). Разобраться как работает, быть готовым рассказать\либо в кратце описать текстом (как хотите)
-Реализовать использование на практике

задание для меня 
hashCode()
deque