Расписание занятий:
Каждое воскресенье с 11 до 19.
Каждый четверг с 9 до 18.
___

Первое занятие 22 марта в 11 утра, последнее - 16 апреля (предварительно - 8 занятий)

Если не буду успевать, буду проводить дополнительные занятия по субботам, увеличивать длительность курса. Коллегам сообщу об изменении расписания минимум за неделю


темы которые планирую дать ребятам:
- Теория тестирования (кратко)
- Основы Java (ООП, коллекции, дженерики, рефлексия, StreamAPI) (Лекция + ДЗ)
- Тестирование Web UI 1 (Maven, TestNG, Selenium) (Лекция + лабораторная + ДЗ)
- Тестирование Web UI 1 (Maven, TestNG, Selenide) (Лекция + лабораторная + ДЗ)
- Паттерны тестирования, PageObject\PageFactory, переработка созданных тестов на Selenide и Selenium (Лекция + лабораторная + ДЗ)
- Использование контейнеризации при АТ, на примере Docker +Selenoid
- Тестирование API (Rest Assured) (Лекция + лабораторная + ДЗ)
- Введение в БД
- SQL (Лабораторная +ДЗ)
- Регулярные выражения (если останется время) (Лекция + лабораторная + ДЗ)
- Основы Git (если останется время)

